Revit 2027 API
ParameterTypeId.RbsElecSwitchIdParam Property
 "Switch ID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecSwitchIdParam { get; }
Public Shared ReadOnly Property RbsElecSwitchIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecSwitchIdParam {
	ForgeTypeId^ get ();
}
static member RbsElecSwitchIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace